LEXICON_RU: dict[str, str] = {
    "/start": "Ты отправил команду старт",
    "/menu": "Ты отправил команду меню",
    "/cart": "Ты отправил команду корзина",
    "/history": "Ты отправил команду история заказов",
    "/news": "Ты отправил команду новости и акции",
    "/settings": "Ты отправил команду настройки",
    "/help": "Список команд:\n "
             "/start - Начало работы\n"
             "/menu - Меню\n"
             "/cart - Корзина\n"
             "/history - История заказов\n"
             "/news - Новости и акции\n"
             "/settings - Настройки\n"
             "/help - Помощь\n"
             "/about - О проекте\n\n"
             "Выберите ниже раздел справки для получение помощи",
    "/about": "Я тестовый бот по доставке еды из ресторана 'TestBurger'.\n\n"
              "Вы можете связаться с моим создателем перейдя по ссылке: "
              "<a href='https://www.linkedin.com/in/andrey-kovaleu/'>LinkedIn</a>, "
              "или нажав на одну из кнопок ниже",
    "beef_burgers": "Вы выбрали бургреры из говядины",
    "chicken_and_fish_burgers": "Вы выбрали бургреры из курицы и рыбы",
    "rolls": "Вы выбрали роллы",
    "snacks": "Вы выбрали закуски",
    "shrimps": "Вы выбрали креветки",
    "cold_drinks": "Вы выбрали холодные напитки",
    "hot_drinks": "Вы выбрали горячие напитки",
    "dessert": "Вы выбрали десерты",
    "sauces": "Вы выбрали соусы",
    "other": "Вы выбрали другое"
}

LEXICON_ADMIN_RU: dict[str, str] = {
    "start": "Бот запущен",
    "stop": "Бот остановлен"
}

LEXICON_COMMANDS_RU: dict[str, str] = {
    "/start": "Начало работы",
    "/menu": "Меню",
    "/cart": "Корзина",
    "/history": "История заказов",
    "/news": "Новости и акции",
    "/settings": "Настройки",
    "/help": "Помощь",
    "/about": "О проекте"
}

LEXICON_BUTTON_RU: dict[str, str] = {
    "menu": "🍴 Меню",
    "cart": "🛒 Корзина",
    "history": "📦 Заказы",
    "news": "📢 Новости",
    "settings": "⚙️ Настройки",
    "help": "❓ Помощь",
    "home": "🏠 В начало",
    "again": "📰 Ещё",
    "back": "⬅️ Назад",
    "name": "👨👩‍ Имя",
    "phone": "☎️ Телефон",
    "address": "📪 Адрес",
    "city": "🏙️ Город",
    "notification": "🔔 Уведомления",
    "message": "📧 Написать",
    "reference": "📩 Помощь на сайте"
}

LEXICON_INLINE_BUTTON_RU: dict[str, str] = {
    "website": "🌐 Сайт",
    "author": "👦 Написать автору",
    "beef_burgers": "🍔 Бургеры из говядины",
    "chicken_and_fish_burgers": "🍔 Бургеры из курицы и рыбы",
    "rolls": "🌯 Роллы",
    "snacks": "🍟 Закуски",
    "shrimps": "🦐 Креветки",
    "cold_drinks": "🥤 Холодные напитки",
    "hot_drinks": "☕ Горячие напитки",
    "dessert": "🍦 Десерты",
    "sauces": "🥫 Соусы",
    "other": "Другое",
    "forward": "Вперед",
    "back": "Назад"
}
